In [2]:
import pandas as pd

In [11]:
demographic_data = pd.read_csv("https://raw.githubusercontent.com/asmaaalaa99/SS154-Final-Project/main/Data/hd2019%20-%20hd2019.csv")
salary_data = pd.read_csv("https://raw.githubusercontent.com/asmaaalaa99/SS154-Final-Project/main/Data/salaries-by-region.csv")
salary_data_school_type = pd.read_csv("/Users/asmaaaly/Minerva/SF_spring/SS154/SS154-assignment/Data/salaries-by-college-type.csv")

In [17]:
salary_data = pd.merge(salary_data,salary_data_school_type[['School Name','School Type']],on='School Name', how='left')

In [42]:
salary_data

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary,School Type
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00",NaN
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN,Engineering
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN,Engineering
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00",State
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN,Liberal Arts
...,...,...,...,...,...,...,...,...,...
335,State University of New York (SUNY) at Potsdam,Northeastern,"$38,000.00","$70,300.00","$35,100.00","$51,200.00","$100,000.00","$179,000.00",State
336,Niagara University,Northeastern,"$36,900.00","$69,700.00","$44,000.00","$57,000.00","$92,000.00","$128,000.00",NaN
337,State University of New York (SUNY) at Fredonia,Northeastern,"$37,800.00","$66,200.00","$32,800.00","$44,200.00","$93,300.00","$181,000.00",State
338,University of Southern Maine,Northeastern,"$39,400.00","$63,600.00","$40,400.00","$47,900.00","$85,700.00","$117,000.00",State
339,Mercy College,Northeastern,"$43,700.00","$62,600.00","$35,600.00","$47,300.00","$99,000.00","$134,000.00",NaN

In [30]:
#only get the first columns of the salary data 
salary_data_clean = salary_data.iloc[:,np.r_[0:4,8:9]]

In [31]:
salary_data_clean.head(5)

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,School Type
0,Stanford University,California,"$70,400.00","$129,000.00",NaN
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",Engineering
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",Engineering
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00",State
4,Occidental College,California,"$51,900.00","$105,000.00",Liberal Arts

In [32]:
demographic_data.head(5)

,UNITID,INSTNM,IALIAS,ADDR,CITY,STABBR,ZIP,FIPS,OBEREG,CHFNM,...,CBSATYPE,CSA,NECTA,COUNTYCD,COUNTYNM,CNGDSTCD,LONGITUD,LATITUDE,DFRCGID,DFRCUSCG
0,100654,Alabama A & M University,AAMU,4900 Meridian Street,Normal,AL,35762,1,5,"Dr. Andrew Hugine, Jr.",...,1,290,-2,1089,Madison County,105,-86.568502,34.783368,112,1
1,100663,University of Alabama at Birmingham,,Administration Bldg Suite 1070,Birmingham,AL,35294-0110,1,5,Ray L. Watts,...,1,142,-2,1073,Jefferson County,107,-86.799345,33.505697,98,1
2,100690,Amridge University,Southern Christian University Regions University,1200 Taylor Rd,Montgomery,AL,36117-3553,1,5,Michael C.Turner,...,1,388,-2,1101,Montgomery County,102,-86.174010,32.362609,129,2
3,100706,University of Alabama in Huntsville,UAH University of Alabama Huntsville,301 Sparkman Dr,Huntsville,AL,35899,1,5,Darren Dawson,...,1,290,-2,1089,Madison County,105,-86.640449,34.724557,102,2
4,100724,Alabama State University,,915 S Jackson Street,Montgomery,AL,36104-0271,1,5,Quinton T. Ross,...,1,388,-2,1101,Montgomery County,107,-86.295677,32.364317,120,1

In [33]:
df1 = demographic_data.copy()
df1.rename({'INSTNM': 'school_name'}, axis=1, inplace=True)
df1["school_name"] = df1["school_name"].str.lower()
df1["school_name"] = df1["school_name"].replace({'-': '', ',': ''}, regex=True)

df2 = salary_data_clean.copy()
df2.rename({'School Name': 'school_name'}, axis=1, inplace=True)
df2["school_name"] = df2["school_name"].str.lower()
df2["school_name"] = df2["school_name"].replace({'-': '', ',': ''}, regex=True)
import re
df2["school_name"].str.lower()
df2["school_name"] = df2["school_name"].apply(lambda x: re.sub(r"\(.*\)", "", x))
df1["school_name"] = df1["school_name"].apply(lambda x: re.sub(r"\(.*\)", "", x))
df1.merge(df2, how='inner', on='school_name')

,UNITID,school_name,IALIAS,ADDR,CITY,STABBR,ZIP,FIPS,OBEREG,CHFNM,...,COUNTYNM,CNGDSTCD,LONGITUD,LATITUDE,DFRCGID,DFRCUSCG,Region,Starting Median Salary,Mid-Career Median Salary,School Type
0,100858,auburn university,,,Auburn,AL,36849,1,5,Jay Gogue,...,Lee County,103,-85.488258,32.599378,97,1,Southern,"$45,400.00","$84,700.00",State
1,102553,university of alaska anchorage,UAA,3211 Providence Drive,Anchorage,AK,99508,2,8,Cathy Sandeen,...,Anchorage Municipality,200,-149.826190,61.190163,110,1,Western,"$45,900.00","$72,600.00",State
2,104179,university of arizona,UA|U of A|Arizona|UofA|The University of Arizo...,1401 E University,Tucson,AZ,85721-0066,4,6,Dr. Robert C. Robbins,...,Pima County,403,-110.950815,32.232672,96,1,Western,"$47,500.00","$86,100.00",State
3,106397,university of arkansas,University of Arkansas|Arkansas,Administration Bldg 425,Fayetteville,AR,72701,5,5,Joseph E. Steinmetz,...,Washington County,503,-94.176981,36.070009,98,1,Southern,"$44,100.00","$82,800.00",State
4,115409,harvey mudd college,"Mudd, HMC",301 Platt Blvd.,Claremont,CA,91711,6,8,Maria Klawe,...,Los Angeles County,627,-117.709837,34.106515,137,1,California,"$71,800.00","$122,000.00",Engineering
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
146,236595,seattle university,Seattle U,900 Broadway,Seattle,WA,98122-4340,53,8,Stephen V Sundborg,...,King County,5309,-122.318851,47.608859,105,1,Western,"$48,300.00","$82,800.00",NaN
147,237011,western washington university,Western Washington State College|Western Washi...,516 High Street,Bellingham,WA,98225-9008,53,8,Sabah Randhawa,...,Whatcom County,5302,-122.485734,48.737812,109,1,Western,"$42,700.00","$75,400.00",State
148,237057,whitman college,,345 Boyer Ave,Walla Walla,WA,99362,53,8,Kathleen Murray,...,Walla Walla County,5305,-118.331546,46.069815,135,1,Western,"$43,500.00","$80,100.00",Liberal Arts
149,239105,marquette university,,1250 W Wisconsin Avenue,Milwaukee,WI,53233,55,3,Dr. Michael Lovell,...,Milwaukee County,5504,-87.927961,43.039030,103,1,Midwestern,"$48,500.00","$88,400.00",NaN
150,243744,stanford university,,,Stanford,CA,94305,6,8,Marc Tessier-Lavigne,...,Santa Clara County,618,-122.167359,37.429434,99,1,California,"$70,400.00","$129,000.00",NaN

In [39]:
import pandas as pd
import difflib

In [35]:
import pandas as pd
import fuzzy_pandas as fpd

matches = fpd.fuzzy_merge(df1, df2, on = ['school_name'],
                          ignore_case=True,
                    method = "levenshtein", threshold = 0.9)

print(matches)

     UNITID                                        school_name  \
0    100663                university of alabama at birmingham
1    100706                university of alabama in huntsville
2    100858                                  auburn university
3    102553                     university of alaska anchorage
4    104179                              university of arizona
..      ...                                                ...
274  240480               university of wisconsinstevens point
275  240727                              university of wyoming
276  243744                                stanford university
277  438498                               stratford university
278  459082  virginia polytechnic institute & state university

                                                IALIAS  \
0
1                UAH  University of Alabama Huntsville
2
3                                                  UAA
4    UA|U of A|Arizona|UofA|The University of Arizo...
..                                                 ...
274                                   UW-Stevens Point
275                                                 UW
276
277
278

                                ADDR           CITY STABBR         ZIP  FIPS  \
0     Administration Bldg Suite 1070     Birmingham     AL  35294-0110     1
1                    301 Sparkman Dr     Huntsville     AL       35899     1
2                                            Auburn     AL       36849     1
3              3211 Providence Drive      Anchorage     AK       99508     2
4                  1401 E University         Tucson     AZ  85721-0066     4
..                               ...            ...    ...         ...   ...
274                     2100 Main St  Stevens Point     WI  54481-3897    55
275      Corner of Ninth and Ivinson        Laramie     WY       82071    56
276                                        Stanford     CA       94305     6
277  3201 Jermantown Road, Suite 500        Fairfax     VA       22030    51
278               2 Riverside Circle        Roanoke     VA  24016-4950    51

     OBEREG                       CHFNM  ... CNGDSTCD    LONGITUD   LATITUDE  \
0         5                Ray L. Watts  ...      107  -86.799345  33.505697
1         5               Darren Dawson  ...      105  -86.640449  34.724557
2         5                   Jay Gogue  ...      103  -85.488258  32.599378
3         8               Cathy Sandeen  ...      200 -149.826190  61.190163
4         6       Dr. Robert C. Robbins  ...      403 -110.950815  32.232672
..      ...                         ...  ...      ...         ...        ...
274       3            Bernie Patterson  ...     5503  -89.570934  44.529582
275       7               Neil Theobald  ...     5600 -105.579310  41.311773
276       8        Marc Tessier-Lavigne  ...      618 -122.167359  37.429434
277       5  Dr.  Richard R. Shurtz, II  ...     5111  -77.310970  38.874798
278       5                              ...     5106  -79.942599  37.257489

    DFRCGID  DFRCUSCG                                        school_name  \
0        98         1               university of alabama at birmingham
1       102         2               university of alabama at huntsville
2        97         1                                  auburn university
3       110         1                     university of alaska anchorage
4        96         1                              university of arizona
..      ...       ...                                                ...
274     127         1            university of wisconsin   stevens point
275     101         1                             university of wyoming
276      99         1                                stanford university
277     119         2                                stanford university
278      -2        -2  virginia polytechnic institute and state unive...

         Region Starting Median Salary Mid-Career Median Salary  School Type
0      Southern             $39,200.00               $70,100.00        State
1      Southern             $43,100.00               $82,700.00        State
2      Southern             $45,400.00               $84,700.00        State
3       Western             $45,900.00               $72,600.00        State
4       Western             $47,500.00               $86,100.00        State
..          ...                    ...                      ...          ...
274  Midwestern             $39,800.00               $64,000.00        State
275     Western             $44,500.00               $78,700.00        State
276  California             $70,400.00              $129,000.00          NaN
277  California             $70,400.00              $129,000.00          NaN
278    Southern             $53,500.00               $95,400.00  Engineering

[279 rows x 78 columns]

In [44]:
location_info = matches.copy()[["CITY","STABBR","LOCALE","School Type"]]

In [45]:
dollar_cols = ['Starting Median Salary','Mid-Career Median Salary']

for x in dollar_cols:
    matches[x] = matches[x].str.replace("$","")
    matches[x] = matches[x].str.replace(",","")
    matches[x] = pd.to_numeric(matches[x])

AttributeError: Can only use .str accessor with string values!

In [46]:
 df_final = matches.copy()

In [47]:
df_final = df_final.groupby(['CITY','STABBR']).agg({'Mid-Career Median Salary':'mean','Starting Median Salary':
 'mean'}).reset_index()

In [48]:
final_clean_data = df_final.merge(location_info, how='inner', on=['CITY','STABBR'])

In [52]:
final_clean_data = final_clean_data.dropna()

In [53]:
final_clean_data.to_csv("Complete_full_data.csv")